In [38]:
import pandas as pd
import numpy as np

data1 = pd.DataFrame(np.random.randn(20, 5), index=[i for i in range(1, 21)], columns=['A', 'B', 'C', 'D', 'E'])
data2 = pd.DataFrame([np.random.randint(1,5,5)], index=[i for i in range(5)], columns=['A', 'B', 'C', 'D', 'E'])

## 1. `SELECT * FROM data;`

In [6]:
data1

           A         B         C         D         E
1  -1.189783 -1.088600 -0.438590 -0.729880  0.090740
2  -0.817648 -1.184841 -1.375551 -1.009540 -0.374561
3  -0.564880  0.294258 -0.412930 -0.697787 -0.182226
4   0.518914  1.611123  1.320449 -1.164903  1.346336
5   1.528600 -0.994454  0.191669  0.411377 -2.381480
6   0.342806  0.241564  1.160190  0.161474 -1.392115
7  -0.025116  1.933845 -0.172797 -0.667240  0.481845
8   0.608132 -0.559541 -0.131132  1.042973 -0.992170
9  -0.305067  0.353071  0.400186  1.230845 -1.789119
10 -0.410804 -0.892339 -1.479155 -1.803460 -0.293945
11  0.068474  0.411368 -2.083877  1.073424 -0.946868
12 -0.583274 -0.220717 -1.151832  0.687377 -2.126922
13  1.289818 -0.678571  0.349918  1.358298 -0.406326
14 -0.835052 -0.045818 -0.447485 -0.472213  0.199000
15 -2.099113 -0.556110  1.011248  0.860335  0.874811
16 -0.066198 -1.718530  0.229300 -0.629952 -0.181608
17 -0.807657  1.637704 -0.060067 -1.263550 -0.091233
18  1.511010  0.083362 -0.064824 -0.795067  0.829708
19  0.292035 -1.189185 -1.435303  0.216069  0.441353
20 -1.129866 -1.826668  0.419377 -1.001408  0.034531

## 2. `SELECT * FROM data LIMIT 10;`

In [7]:
data1.head(10)

           A         B         C         D         E
1  -1.189783 -1.088600 -0.438590 -0.729880  0.090740
2  -0.817648 -1.184841 -1.375551 -1.009540 -0.374561
3  -0.564880  0.294258 -0.412930 -0.697787 -0.182226
4   0.518914  1.611123  1.320449 -1.164903  1.346336
5   1.528600 -0.994454  0.191669  0.411377 -2.381480
6   0.342806  0.241564  1.160190  0.161474 -1.392115
7  -0.025116  1.933845 -0.172797 -0.667240  0.481845
8   0.608132 -0.559541 -0.131132  1.042973 -0.992170
9  -0.305067  0.353071  0.400186  1.230845 -1.789119
10 -0.410804 -0.892339 -1.479155 -1.803460 -0.293945

## 3. `SELECT id FROM data;`

In [8]:
data1['B']

1    -1.088600
2    -1.184841
3     0.294258
4     1.611123
5    -0.994454
6     0.241564
7     1.933845
8    -0.559541
9     0.353071
10   -0.892339
11    0.411368
12   -0.220717
13   -0.678571
14   -0.045818
15   -0.556110
16   -1.718530
17    1.637704
18    0.083362
19   -1.189185
20   -1.826668
Name: B, dtype: float64

## 4. `SELECT COUNT(id) FROM data;`

In [11]:
data1['B'].count()

20

## 5. `SELECT * FROM data WHERE id<1000 AND age>30;`

In [15]:
data1[(data1['B'] < 0) & (data1['D'] > 1)]

           A         B         C         D         E
8   0.608132 -0.559541 -0.131132  1.042973 -0.992170
13  1.289818 -0.678571  0.349918  1.358298 -0.406326

## 6. `SELECT id,COUNT(DISTINCT order_id) FROM table1 GROUP BY id;`

In [46]:
data1.groupby('A')['D'].count()

A
-1.858246    1
-1.677584    1
-1.477360    1
-1.314514    1
-1.182889    1
-1.044042    1
-0.958248    1
-0.665230    1
-0.393628    1
-0.380842    1
-0.181235    1
-0.122500    1
 0.131819    1
 0.347386    1
 1.178058    1
 1.479447    1
 1.497975    1
 1.540477    1
 1.609544    1
 1.783139    1
Name: D, dtype: int64

## 7. `SELECT * FROM table1 t1 INNER JOIN table2 t2 ON t1.id = t2.id;`

In [51]:
new_data = pd.merge(data1, data2, on='B', how='inner')
new_data['B']

Series([], Name: B, dtype: float64)

## 8. `SELECT * FROM table1 UNION SELECT * FROM table2;`

In [52]:
pd.concat([data1, data2])

           A         B         C         D         E
1  -1.677584  1.995542 -0.256570  0.791798  1.003123
2   1.783139 -0.992434 -1.101299 -0.079591 -0.168830
3  -1.182889  0.426132 -0.666593 -0.393178 -0.089776
4   1.479447  0.914307 -0.850135 -0.545530  1.924193
5  -0.958248  2.418816  0.251613  0.490435 -1.008736
6  -0.665230  1.030292  0.080543 -0.701601 -0.598544
7   1.178058 -2.611696 -1.053333 -2.104941  0.083467
8  -0.380842 -0.472701  0.323309  1.399564 -1.049885
9  -0.181235  0.846401  0.190243  1.103312 -0.665880
10 -0.393628  0.359380 -0.042286  0.904374 -0.654111
11 -0.122500  0.466699  1.518284  0.035848  0.684691
12  0.347386  0.099527  0.229662 -2.074592 -0.764028
13  0.131819  0.499305  0.184627  0.018106  1.314154
14  1.540477 -0.852883  1.094358  0.913407  1.193639
15 -1.314514 -0.469652 -1.054219 -0.422852 -0.580359
16 -1.477360  3.628839 -0.187280 -1.246683  0.203187
17 -1.858246 -0.271262 -0.406770 -0.248554  1.278984
18  1.609544 -1.393252  0.771675 -0.587583  2.006423
19 -1.044042  0.425563 -0.467657 -0.056696  0.361454
20  1.497975 -0.000148  0.602092 -0.064996  0.612961
0   4.000000  3.000000  3.000000  4.000000  1.000000
1   4.000000  3.000000  3.000000  4.000000  1.000000
2   4.000000  3.000000  3.000000  4.000000  1.000000
3   4.000000  3.000000  3.000000  4.000000  1.000000
4   4.000000  3.000000  3.000000  4.000000  1.000000

## 9. `DELETE FROM table1 WHERE id=10;`

In [56]:
data2.loc[data2['B'] != 2]

   A  B  C  D  E
0  4  3  3  4  1
1  4  3  3  4  1
2  4  3  3  4  1
3  4  3  3  4  1
4  4  3  3  4  1

## 10. `ALTER TABLE table1 DROP COLUMN column_name;`

In [57]:
data2.drop(columns='B')

   A  C  D  E
0  4  3  4  1
1  4  3  4  1
2  4  3  4  1
3  4  3  4  1
4  4  3  4  1